erp3l/src/Catalogs/ВидыКотировокФинансовыхИнструментов/ВидыКотировокФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКотировокФинансовыхИнструментов</name>
  <predefined>
    <items>
      <name>MosPrime1M</name>
      <description>MosPrime 1M</description>
    </items>
    <items>
      <name>MosPrime1W</name>
      <description>MosPrime 1W</description>
    </items>
    <items>
      <name>MosPrime2M</name>
      <description>MosPrime 2M</description>
    </items>
    <items>
      <name>MosPrime2W</name>
      <description>MosPrime 2W</description>
    </items>
    <items>
      <name>MosPrime3M</name>
      <description>MosPrime 3M</description>
    </items>
    <items>
      <name>MosPrime6M</name>
      <description>MosPrime 6M</description>
    </items>
    <items>
      <name>MosPrimeON</name>
      <description>MosPrime ON</description>
    </items>
    <items>
      <name>КлючеваяСтавкаЦБРФ</name>
      <description>Ключевая ставка ЦБРФ</description>
    </items>
  </predefined>
  <attributes>
    <name>БазовыйВидКотировки</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКотировкиПоправка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеНадБазовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадБазовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадБазовойКотировкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКотировки</name>
    <type>
      <types>EnumRef.ТипыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КодЦБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ВидыКотировокФинансовыхИнструментов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ПолучитьОписаниеЗначенияКотировки(ОбъектКотировки) Экспорт
	
	ТипКотировки = ТипЗнч(ОбъектКотировки);
		
	Если ТипКотировки = Тип("СправочникСсылка.ЦенныеБумаги") Тогда		
		
		Если ОбъектКотировки.Пустая() Тогда
			Возврат "";	
		ИначеЕсли ОбъектКотировки.Котировка.Пустая() Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 ценную бумагу'"), ОбъектКотировки.ВалютаНоминала);		
		Иначе 
			Котировка = ОбъектКотировки.Котировка;			
		КонецЕсли;
		
	ИначеЕсли ТипКотировки = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Если ОбъектКотировки.Пустая() Тогда
			Возврат "";	
		ИначеЕсли ОбъектКотировки.Котировка.Пустая() Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 %2'"), ОбъектКотировки.ВалютаВзаиморасчетов, ОбъектКотировки.Организация.ФункциональнаяВалюта);
		Иначе 
			Котировка = ОбъектКотировки.Котировка;			
		КонецЕсли;
		
	Иначе 
		
		Котировка = ОбъектКотировки;
		
	КонецЕсли;	
	
	Если ТипКотировки = Тип("СправочникСсылка.ВидыКотировокФинансовыхИнструментов") Тогда
				
		ТипКотировки = Котировка.ТипКотировки;
		БазоваяВалюта = Котировка.Валюта;
		КотируемаяВалюта = Котировка.ФункциональнаяВалюта;
		
		Если (ТипКотировки = ПредопределенноеЗначение("Перечисление.ТипыКотировокФинансовыхИнструментов.РыночнаяСтавкаПроцента"))
			Или (ТипКотировки = ПредопределенноеЗначение("Перечисление.ТипыКотировокФинансовыхИнструментов.БанковскаяСтавкаПроцента")) Тогда
			
			Возврат "%";
			
		Иначе 
			
			Валюта1 = ?(ЗначениеЗаполнено(КотируемаяВалюта), КотируемаяВалюта, НСтр("ru = 'котируемой валюты'"));
			Валюта2 = ?(ЗначениеЗаполнено(БазоваяВалюта), БазоваяВалюта, НСтр("ru = 'базовой валюты'"));
			
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 %2'"), Валюта1, Валюта2);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ""; 
	
КонецФункции

Функция ПолучитьЗначенияКотировок(Котировки, Дата) Экспорт

	

КонецФункции

Функция ТекстЗапросаКотировок(НомераТаблиц = Неопределено) Экспорт

	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("ЗначенияКотировок", НомераТаблиц.Количество());
	КонецЕсли;
	
	Возврат
	"ВЫБРАТЬ
	|	втКотировки.ВидКотировки КАК ВидКотировки,
	|	втКотировки.Значение
	|
	|ИЗ
	|	РегистрСведений.ЗначенияКотировокФИ.СрезПоследних(
	|			&Дата,
	|			ВидКотировки В
	|				(ВЫБРАТЬ
	|					т.ВидКотировки
	|				ИЗ
	|					втВидыКотировок КАК т)) КАК втКотировки";
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИБ
Процедура ЗаполнитьПредопределенныеДанные(Параметры = Неопределено) Экспорт
	
	ОбъектМетаданных = Метаданные.Справочники.ВидыКотировокФинансовыхИнструментов;
	ТабДок = ПолучитьМакет("ПредопределенныеДанные_ru");
	
	ОбновлениеИнформационнойБазыУХСлужебный.ЗаполнитьРеквизитыПредопределенныхЭлементовИзМакета(ОбъектМетаданных, ТабДок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
